cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="AIPSTZ1">
      <name>AIPSTZ2</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ2_</prependToName>
      <baseAddress>0x4017C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="AIPSTZ1">
      <name>AIPSTZ3</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ3_</prependToName>
      <baseAddress>0x4027C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="AIPSTZ1">
      <name>AIPSTZ4</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ4_</prependToName>
      <baseAddress>0x4037C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>DCDC</name>
      <description>DCDC</description>
      <groupName>DCDC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DCDC</name>
        <value>69</value>
      </interrupt>
      <registers>
        <register>
          <name>REG0</name>
          <description>DCDC Register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x14030111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWD_ZCD</name>
              <description>power down the zero cross detection function for discontinuous conductor mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_AUTO_CLK_SWITCH</name>
              <description>Disable automatic clock switch from internal osc to xtal clock.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_CLK</name>
              <description>select 24 MHz Crystal clock for DCDC, when dcdc_disable_auto_clk_switch is set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_OSC_INT</name>
              <description>Power down internal osc. Only set this bit, when 24 MHz crystal osc is available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_CUR_SNS_CMP</name>
              <description>The power down signal of the current detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUR_SNS_THRSH</name>
              <description>Set the threshold of current detector, if the peak current of the inductor exceeds the threshold, the current detector will assert</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_OVERCUR_DET</name>
              <description>power down overcurrent detection comparator</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVERCUR_TRIG_ADJ</name>
              <description>The threshold of over current detection in run mode and power save mode: run mode power save mode 0x0 1 A 0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_CMP_BATT_DET</name>
              <description>set to &quot;1&quot; to power down the low voltage detection comparator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADJ_POSLIMIT_BUCK</name>
              <description>adjust value to poslimit_buck register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_LP_OVERLOAD_SNS</name>
              <description>enable the overload detection in power save mode, if current is larger than the overloading threshold (typical value is 50 mA), DCDC will switch to the run mode automatically</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_HIGH_VOLT_DET</name>
              <description>power down overvoltage detection comparator</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_OVERLOAD_THRSH</name>
              <description>the threshold of the counting number of charging times during the period that lp_overload_freq_sel sets in power save mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_OVERLOAD_FREQ_SEL</name>
              <description>the period of counting the charging times in power save mode 0: eight 32k cycle 1: sixteen 32k cycle</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_HIGH_HYS</name>
              <description>Adjust hysteretic value in low power from 12.5mV to 25mV</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_CMP_OFFSET</name>
              <description>power down output range comparator</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTALOK_DISABLE</name>
              <description>1'b1: Disable xtalok detection circuit 1'b0: Enable xtalok detection circuit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURRENT_ALERT_RESET</name>
              <description>reset current alert signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_24M_OK</name>
              <description>set to 1 to switch internal ring osc to xtal 24M</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STS_DC_OK</name>
              <description>Status register to indicate DCDC status. 1'b1: DCDC already settled 1'b0: DCDC is settling</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG1</name>
          <description>DCDC Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x111BA29C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_FBK_SEL</name>
              <description>select the feedback point of the internal regulator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_RLOAD_SW</name>
              <description>control the load resistor of the internal regulator of DCDC, the load resistor is connected as default &quot;1&quot;, and need set to &quot;0&quot; to disconnect the load resistor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CMP_ISRC_SEL</name>
              <description>set the current bias of low power comparator 0x0: 50 nA 0x1: 100 nA 0x2: 200 nA 0x3: 400 nA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_HST_THRESH</name>
              <description>increase the threshold detection for common mode analog comparator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_EN_HYST</name>
              <description>Enable hysteresis in switching converter common mode analog comparators</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBG_TRIM</name>
              <description>trim bandgap voltage</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG2</name>
          <description>DCDC Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4009</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOOPCTRL_DC_C</name>
              <description>Ratio of integral control parameter to proportional control parameter in the switching DC-DC converter, and can be used to optimize efficiency and loop response</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_DC_R</name>
              <description>Magnitude of proportional control parameter in the switching DC-DC converter control loop.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_DC_FF</name>
              <description>Two's complement feed forward step in duty cycle in the switching DC-DC converter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_EN_RCSCALE</name>
              <description>Enable analog circuit of DC-DC converter to respond faster under transient load conditions.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_RCSCALE_THRSH</name>
              <description>Increase the threshold detection for RC scale circuit.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_HYST_SIGN</name>
              <description>Invert the sign of the hysteresis in DC-DC analog comparators.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_PULSE_SKIP</name>
              <description>Set to &quot;0&quot; : stop charging if the duty cycle is lower than what set by dcdc_neglimit_in</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCM_SET_CTRL</name>
              <description>Set high to improve the transition from heavy load to light load</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG3</name>
          <description>DCDC Register 3</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRG</name>
              <description>Target value of VDD_SOC, 25 mV each step 0x0: 0.8V 0xE: 1.15V 0x1F:1.575V</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET_LP</name>
              <description>Target value of standby (low power) mode 0x0: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINPWR_DC_HALFCLK</name>
              <description>Set DCDC clock to half freqeuncy for continuous mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MISC_DELAY_TIMING</name>
              <description>Ajust delay to reduce ground noise</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MISC_DISABLEFET_LOGIC</name>
              <description>Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_STEP</name>
              <description>Disable stepping for the output VDD_SOC of DCDC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
