cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>GPR12</name>
          <description>GPR12 General Purpose Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXIO1_IPG_STOP_MODE</name>
              <description>FlexIO1 stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_STOP_MODE_0</name>
                  <description>FlexIO1 is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, FlexIO1 is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO1_IPG_DOZE</name>
              <description>FLEXIO1 ipg_doze mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_DOZE_0</name>
                  <description>FLEXIO1 is not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_DOZE_1</name>
                  <description>FLEXIO1 is in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO2_IPG_STOP_MODE</name>
              <description>FlexIO2 stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_STOP_MODE_0</name>
                  <description>FlexIO2 is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, FlexIO2 is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO2_IPG_DOZE</name>
              <description>FLEXIO2 ipg_doze mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_DOZE_0</name>
                  <description>FLEXIO2 is not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_DOZE_1</name>
                  <description>FLEXIO2 is in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP_IPG_STOP_MODE</name>
              <description>ACMP stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP_IPG_STOP_MODE_0</name>
                  <description>ACMP is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, ACMP is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO3_IPG_STOP_MODE</name>
              <description>FlexIO3 stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_STOP_MODE_0</name>
                  <description>FlexIO3 is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, FlexIO3 is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO3_IPG_DOZE</name>
              <description>FLEXIO3 ipg_doze mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_DOZE_0</name>
                  <description>FLEXIO3 is not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_DOZE_1</name>
                  <description>FLEXIO3 is in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR13</name>
          <description>GPR13 General Purpose Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARCACHE_USDHC</name>
              <description>uSDHC block cacheable attribute value of AXI read transactions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARCACHE_USDHC_0</name>
                  <description>Cacheable attribute is off for read transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARCACHE_USDHC_1</name>
                  <description>Cacheable attribute is on for read transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWCACHE_USDHC</name>
              <description>uSDHC block cacheable attribute value of AXI write transactions</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AWCACHE_USDHC_0</name>
                  <description>Cacheable attribute is off for write transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWCACHE_USDHC_1</name>
                  <description>Cacheable attribute is on for write transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANFD_STOP_REQ</name>
              <description>CANFD stop request.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CANFD_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANFD_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_ENET</name>
              <description>ENET block cacheable attribute value of AXI transactions</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CACHE_ENET_0</name>
                  <description>Cacheable attribute is off for read/write transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE_ENET_1</name>
                  <description>Cacheable attribute is on for read/write transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_USB</name>
              <description>USB block cacheable attribute value of AXI transactions</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CACHE_USB_0</name>
                  <description>Cacheable attribute is off for read/write transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE_USB_1</name>
                  <description>Cacheable attribute is on for read/write transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANFD_STOP_ACK</name>
              <description>CANFD stop acknowledge.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CANFD_STOP_ACK_0</name>
                  <description>CANFD stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANFD_STOP_ACK_1</name>
                  <description>CANFD stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
