cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>LPTDCR</name>
          <description>SNVS_LP Tamper Detectors Configuration Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRTCR_EN</name>
              <description>SRTC Rollover Enable When set, an SRTC rollover event generates an LP security violation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRTCR_EN_0</name>
                  <description>SRTC rollover is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRTCR_EN_1</name>
                  <description>SRTC rollover is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCR_EN</name>
              <description>MC Rollover Enable When set, an MC Rollover event generates an LP security violation.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCR_EN_0</name>
                  <description>MC rollover is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCR_EN_1</name>
                  <description>MC rollover is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ET1_EN</name>
              <description>External Tampering 1 Enable When set, external tampering 1 detection generates an LP security violation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ET1_EN_0</name>
                  <description>External tamper 1 is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ET1_EN_1</name>
                  <description>External tamper 1 is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ET1P</name>
              <description>External Tampering 1 Polarity This bit is used to determine the polarity of external tamper 1.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ET1P_0</name>
                  <description>External tamper 1 is active low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ET1P_1</name>
                  <description>External tamper 1 is active high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD_OBSERV</name>
              <description>System Power Fail Detector (PFD) Observability Flop The asynchronous reset input of this flop is connected directly to the inverted output of the PFD analog circuitry (external to the SNVS block)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POR_OBSERV</name>
              <description>Power On Reset (POR) Observability Flop The asynchronous reset input of this flop is connected directly to the output of the POR analog circuitry (external to the SNVS</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCB</name>
              <description>Oscillator Bypass When OSCB=1 the osc_bypass signal is asserted</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCB_0</name>
                  <description>Normal SRTC clock oscillator not bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCB_1</name>
                  <description>Normal SRTC clock oscillator bypassed. Alternate clock can drive the SRTC clock source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSR</name>
          <description>SNVS_LP Status Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPTA</name>
              <description>LP Time Alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPTA_0</name>
                  <description>No time alarm interrupt occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPTA_1</name>
                  <description>A time alarm interrupt occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRTCR</name>
              <description>Secure Real Time Counter Rollover</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRTCR_0</name>
                  <description>SRTC has not reached its maximum value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRTCR_1</name>
                  <description>SRTC has reached its maximum value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCR</name>
              <description>Monotonic Counter Rollover</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCR_0</name>
                  <description>MC has not reached its maximum value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCR_1</name>
                  <description>MC has reached its maximum value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGD</name>
              <description>Power Supply Glitch Detected 0 No power supply glitch. 1 Power supply glitch is detected.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ET1D</name>
              <description>External Tampering 1 Detected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ET1D_0</name>
                  <description>External tampering 1 not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ET1D_1</name>
                  <description>External tampering 1 detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESVD</name>
              <description>External Security Violation Detected Indicates that a security violation is detected on one of the HP security violation ports</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESVD_0</name>
                  <description>No external security violation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESVD_1</name>
                  <description>External security violation is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EO</name>
              <description>Emergency Off This bit is set when a power off is requested.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EO_0</name>
                  <description>Emergency off was not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EO_1</name>
                  <description>Emergency off was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPO</name>
              <description>Set Power Off The SPO bit is set when the power button is pressed longer than the configured debounce time</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPO_0</name>
                  <description>Set Power Off was not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPO_1</name>
                  <description>Set Power Off was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SED</name>
              <description>Scan Exit Detected</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SED_0</name>
                  <description>Scan exit was not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SED_1</name>
                  <description>Scan exit was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPNS</name>
              <description>LP Section is Non-Secured Indicates that LP section was provisioned/programmed in the non-secure state</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPNS_0</name>
                  <description>LP section was not programmed in the non-secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPNS_1</name>
                  <description>LP section was programmed in the non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPS</name>
              <description>LP Section is Secured Indicates that the LP section is provisioned/programmed in the secure or trusted state</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPS_0</name>
                  <description>LP section was not programmed in secure or trusted state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPS_1</name>
                  <description>LP section was programmed in secure or trusted state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSRTCMR</name>
          <description>SNVS_LP Secure Real Time Counter MSB Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRTC</name>
              <description>LP Secure Real Time Counter The most-significant 15 bits of the SRTC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSRTCLR</name>
          <description>SNVS_LP Secure Real Time Counter LSB Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRTC</name>
              <description>LP Secure Real Time Counter least-significant 32 bits This register can be programmed only when SRTC is not active and not locked, meaning the SRTC_ENV, SRTC_SL, and SRTC_HL bits are not set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPTAR</name>
          <description>SNVS_LP Time Alarm Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPTA</name>
              <description>LP Time Alarm This register can be programmed only when the LP time alarm is disabled (LPTA_EN bit is not set)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSMCMR</name>
          <description>SNVS_LP Secure Monotonic Counter MSB Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MON_COUNTER</name>
              <description>Monotonic Counter most-significant 16 Bits The MC is incremented by one when: A write transaction to the LPSMCMR or LPSMCLR register is detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MC_ERA_BITS</name>
              <description>Monotonic Counter Era Bits These bits are inputs to the module and typically connect to fuses</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSMCLR</name>
          <description>SNVS_LP Secure Monotonic Counter LSB Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MON_COUNTER</name>
              <description>Monotonic Counter bits The MC is incremented by one when: A write transaction to the LPSMCMR or LPSMCLR Register is detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPGDR</name>
          <description>SNVS_LP Power Glitch Detector Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGD</name>
              <description>Power Glitch Detector Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPGPR0_legacy_alias</name>
          <description>SNVS_LP General Purpose Register 0 (legacy alias)</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR</name>
              <description>General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>LPZMKR[%s]</name>
          <description>SNVS_LP Zeroizable Master Key Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZMK</name>
              <description>Zeroizable Master Key Each of these registers contains 32 bits of the 256-bit ZMK value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>LPGPR_alias[%s]</name>
          <description>SNVS_LP General Purpose Registers 0 .. 3</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR</name>
              <description>General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>LPGPR[%s]</name>
          <description>SNVS_LP General Purpose Registers 0 .. 7</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR</name>
              <description>General Purpose Register When GPR_SL or GPR_HL bit is set, the register cannot be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPVIDR1</name>
          <description>SNVS_HP Version ID Register 1</description>
          <addressOffset>0xBF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3E0104</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MINOR_REV</name>
              <description>SNVS block minor version number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR_REV</name>
              <description>SNVS block major version number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IP_ID</name>
              <description>SNVS block ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
