cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>MISC0_TOG</name>
          <description>Miscellaneous Register 0</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REFTOP_PWD</name>
              <description>Control bit to power-down the analog bandgap reference circuitry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFTOP_SELFBIASOFF</name>
              <description>Control bit to disable the self-bias circuit in the analog bandgap</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFTOP_SELFBIASOFF_0</name>
                  <description>Uses coarse bias currents for startup</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_SELFBIASOFF_1</name>
                  <description>Uses bandgap-based bias currents for best performance.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFTOP_VBGADJ</name>
              <description>Not related to oscillator.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_0</name>
                  <description>Nominal VBG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_1</name>
                  <description>VBG+0.78%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_2</name>
                  <description>VBG+1.56%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_3</name>
                  <description>VBG+2.34%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_4</name>
                  <description>VBG-0.78%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_5</name>
                  <description>VBG-1.56%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_6</name>
                  <description>VBG-2.34%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFTOP_VBGADJ_7</name>
                  <description>VBG-3.12%</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFTOP_VBGUP</name>
              <description>Status bit that signals the analog bandgap voltage is up and stable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_MODE_CONFIG</name>
              <description>Configure the analog behavior in stop mode.Not related to oscillator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_MODE_CONFIG_0</name>
                  <description>All analog except rtc powered down on stop mode assertion. XtalOsc=on, RCOsc=off;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_MODE_CONFIG_1</name>
                  <description>Certain analog functions such as certain regulators left up. XtalOsc=on, RCOsc=off;</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_MODE_CONFIG_2</name>
                  <description>XtalOsc=off, RCOsc=on, Old BG=on, New BG=off.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_MODE_CONFIG_3</name>
                  <description>XtalOsc=off, RCOsc=on, Old BG=off, New BG=on.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCON_HIGH_SNVS</name>
              <description>This bit controls a switch from VDD_HIGH_IN to VDD_SNVS_IN.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCON_HIGH_SNVS_0</name>
                  <description>Turn on the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCON_HIGH_SNVS_1</name>
                  <description>Turn off the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_I</name>
              <description>This field determines the bias current in the 24MHz oscillator</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMINAL</name>
                  <description>Nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_12_5_PERCENT</name>
                  <description>Decrease current by 12.5%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_25_PERCENT</name>
                  <description>Decrease current by 25.0%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_37_5_PERCENT</name>
                  <description>Decrease current by 37.5%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_XTALOK</name>
              <description>Status bit that signals that the output of the 24-MHz crystal oscillator is stable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_XTALOK_EN</name>
              <description>This bit enables the detector that signals when the 24MHz crystal oscillator is stable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKGATE_CTRL</name>
              <description>This bit allows disabling the clock gate (always ungated) for the xtal 24MHz clock that clocks the digital logic in the analog block</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOW_AUTO_GATE</name>
                  <description>Allow the logic to automatically gate the clock when the XTAL is powered down.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_AUTO_GATE</name>
                  <description>Prevent the logic from ever gating off the clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE_DELAY</name>
              <description>This field specifies the delay between powering up the XTAL 24MHz clock and releasing the clock to the digital logic inside the analog block</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_0</name>
                  <description>0.5ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_1</name>
                  <description>1.0ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_2</name>
                  <description>2.0ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_3</name>
                  <description>3.0ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_4</name>
                  <description>4.0ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_5</name>
                  <description>5.0ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_6</name>
                  <description>6.0ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGATE_DELAY_7</name>
                  <description>7.0ms</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_XTAL_SOURCE</name>
              <description>This field indicates which chip source is being used for the rtc clock.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTC_XTAL_SOURCE_0</name>
                  <description>Internal ring oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_XTAL_SOURCE_1</name>
                  <description>RTC_XTAL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_24M_PWD</name>
              <description>This field powers down the 24M crystal oscillator if set true.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VID_PLL_PREDIV</name>
              <description>Predivider for the source clock of the PLL's. Not related to oscillator.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VID_PLL_PREDIV_0</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VID_PLL_PREDIV_1</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWPWR_CTRL</name>
          <description>XTAL OSC (LP) Control Register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RC_OSC_EN</name>
              <description>RC Osc. enable control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_OSC_EN_0</name>
                  <description>Use XTAL OSC to source the 24MHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_OSC_EN_1</name>
                  <description>Use RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_SEL</name>
              <description>Select the source for the 24MHz clock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_SEL_0</name>
                  <description>XTAL OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_SEL_1</name>
                  <description>RC OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_SEL</name>
              <description>Bandgap select. Not related to oscillator.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPBG_SEL_0</name>
                  <description>Normal power bandgap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPBG_SEL_1</name>
                  <description>Low power bandgap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPBG_TEST</name>
              <description>Low power bandgap test bit. Not related to oscillator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFTOP_IBIAS_OFF</name>
              <description>Low power reftop ibias disable. Not related to oscillator.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_PWRGATE</name>
              <description>L1 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L2_PWRGATE</name>
              <description>L2 power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PWRGATE</name>
              <description>CPU power gate control. Used as software override. Test purpose only Not related to oscillator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPLAY_PWRGATE</name>
              <description>Display logic power gate control. Used as software override. Not related to oscillator.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSC_CG_OVERRIDE</name>
              <description>For debug purposes only</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTALOSC_PWRUP_DELAY</name>
              <description>Specifies the time delay between when the 24MHz xtal is powered up until it is stable and ready to use</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_0</name>
                  <description>0.25ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_1</name>
                  <description>0.5ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_2</name>
                  <description>1ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_DELAY_3</name>
                  <description>2ms</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALOSC_PWRUP_STAT</name>
              <description>Status of the 24MHz xtal oscillator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_0</name>
                  <description>Not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALOSC_PWRUP_STAT_1</name>
                  <description>Stable and ready to use</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIX_PWRGATE</name>
              <description>Display power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPU_PWRGATE</name>
              <description>GPU power gate control. Used as software mask. Set to zero to force ungated.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
