cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
                  <name>HRS24_1</name>
                  <description>A hardware service request for channel 24 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS25</name>
              <description>Hardware Request Status Channel 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS25_0</name>
                  <description>A hardware service request for channel 25 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS25_1</name>
                  <description>A hardware service request for channel 25 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS26</name>
              <description>Hardware Request Status Channel 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS26_0</name>
                  <description>A hardware service request for channel 26 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS26_1</name>
                  <description>A hardware service request for channel 26 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS27</name>
              <description>Hardware Request Status Channel 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS27_0</name>
                  <description>A hardware service request for channel 27 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS27_1</name>
                  <description>A hardware service request for channel 27 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS28</name>
              <description>Hardware Request Status Channel 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS28_0</name>
                  <description>A hardware service request for channel 28 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS28_1</name>
                  <description>A hardware service request for channel 28 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS29</name>
              <description>Hardware Request Status Channel 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS29_0</name>
                  <description>A hardware service request for channel 29 is not preset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS29_1</name>
                  <description>A hardware service request for channel 29 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS30</name>
              <description>Hardware Request Status Channel 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS30_0</name>
                  <description>A hardware service request for channel 30 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS30_1</name>
                  <description>A hardware service request for channel 30 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS31</name>
              <description>Hardware Request Status Channel 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS31_0</name>
                  <description>A hardware service request for channel 31 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS31_1</name>
                  <description>A hardware service request for channel 31 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
