cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>EARS</name>
          <description>Enable Asynchronous Request in Stop Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDREQ_0</name>
              <description>Enable asynchronous DMA request in stop mode for channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_0_0</name>
                  <description>Disable asynchronous DMA request for channel 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_0_1</name>
                  <description>Enable asynchronous DMA request for channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_1</name>
              <description>Enable asynchronous DMA request in stop mode for channel 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_1_0</name>
                  <description>Disable asynchronous DMA request for channel 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_1_1</name>
                  <description>Enable asynchronous DMA request for channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_2</name>
              <description>Enable asynchronous DMA request in stop mode for channel 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_2_0</name>
                  <description>Disable asynchronous DMA request for channel 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_2_1</name>
                  <description>Enable asynchronous DMA request for channel 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_3</name>
              <description>Enable asynchronous DMA request in stop mode for channel 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_3_0</name>
                  <description>Disable asynchronous DMA request for channel 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_3_1</name>
                  <description>Enable asynchronous DMA request for channel 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_4</name>
              <description>Enable asynchronous DMA request in stop mode for channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_4_0</name>
                  <description>Disable asynchronous DMA request for channel 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_4_1</name>
                  <description>Enable asynchronous DMA request for channel 4.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_5</name>
              <description>Enable asynchronous DMA request in stop mode for channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_5_0</name>
                  <description>Disable asynchronous DMA request for channel 5.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_5_1</name>
                  <description>Enable asynchronous DMA request for channel 5.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_6</name>
              <description>Enable asynchronous DMA request in stop mode for channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_6_0</name>
                  <description>Disable asynchronous DMA request for channel 6.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_6_1</name>
                  <description>Enable asynchronous DMA request for channel 6.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_7</name>
              <description>Enable asynchronous DMA request in stop mode for channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_7_0</name>
                  <description>Disable asynchronous DMA request for channel 7.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_7_1</name>
                  <description>Enable asynchronous DMA request for channel 7.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_8</name>
              <description>Enable asynchronous DMA request in stop mode for channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_8_0</name>
                  <description>Disable asynchronous DMA request for channel 8.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_8_1</name>
                  <description>Enable asynchronous DMA request for channel 8.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_9</name>
              <description>Enable asynchronous DMA request in stop mode for channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_9_0</name>
                  <description>Disable asynchronous DMA request for channel 9.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_9_1</name>
                  <description>Enable asynchronous DMA request for channel 9.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_10</name>
              <description>Enable asynchronous DMA request in stop mode for channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_10_0</name>
                  <description>Disable asynchronous DMA request for channel 10.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_10_1</name>
                  <description>Enable asynchronous DMA request for channel 10.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_11</name>
              <description>Enable asynchronous DMA request in stop mode for channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_11_0</name>
                  <description>Disable asynchronous DMA request for channel 11.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_11_1</name>
                  <description>Enable asynchronous DMA request for channel 11.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_12</name>
              <description>Enable asynchronous DMA request in stop mode for channel 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_12_0</name>
                  <description>Disable asynchronous DMA request for channel 12.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_12_1</name>
                  <description>Enable asynchronous DMA request for channel 12.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_13</name>
              <description>Enable asynchronous DMA request in stop mode for channel 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_13_0</name>
                  <description>Disable asynchronous DMA request for channel 13.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_13_1</name>
                  <description>Enable asynchronous DMA request for channel 13.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_14</name>
              <description>Enable asynchronous DMA request in stop mode for channel 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_14_0</name>
                  <description>Disable asynchronous DMA request for channel 14.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_14_1</name>
                  <description>Enable asynchronous DMA request for channel 14.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_15</name>
              <description>Enable asynchronous DMA request in stop mode for channel 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_15_0</name>
                  <description>Disable asynchronous DMA request for channel 15.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_15_1</name>
                  <description>Enable asynchronous DMA request for channel 15.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_16</name>
              <description>Enable asynchronous DMA request in stop mode for channel 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_16_0</name>
                  <description>Disable asynchronous DMA request for channel 16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_16_1</name>
                  <description>Enable asynchronous DMA request for channel 16</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_17</name>
              <description>Enable asynchronous DMA request in stop mode for channel 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_17_0</name>
                  <description>Disable asynchronous DMA request for channel 17</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_17_1</name>
                  <description>Enable asynchronous DMA request for channel 17</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_18</name>
              <description>Enable asynchronous DMA request in stop mode for channel 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_18_0</name>
                  <description>Disable asynchronous DMA request for channel 18</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_18_1</name>
                  <description>Enable asynchronous DMA request for channel 18</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_19</name>
              <description>Enable asynchronous DMA request in stop mode for channel 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_19_0</name>
                  <description>Disable asynchronous DMA request for channel 19</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_19_1</name>
                  <description>Enable asynchronous DMA request for channel 19</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_20</name>
              <description>Enable asynchronous DMA request in stop mode for channel 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_20_0</name>
                  <description>Disable asynchronous DMA request for channel 20</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_20_1</name>
                  <description>Enable asynchronous DMA request for channel 20</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_21</name>
              <description>Enable asynchronous DMA request in stop mode for channel 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_21_0</name>
                  <description>Disable asynchronous DMA request for channel 21</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_21_1</name>
                  <description>Enable asynchronous DMA request for channel 21</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_22</name>
              <description>Enable asynchronous DMA request in stop mode for channel 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_22_0</name>
                  <description>Disable asynchronous DMA request for channel 22</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_22_1</name>
                  <description>Enable asynchronous DMA request for channel 22</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_23</name>
              <description>Enable asynchronous DMA request in stop mode for channel 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_23_0</name>
                  <description>Disable asynchronous DMA request for channel 23</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_23_1</name>
                  <description>Enable asynchronous DMA request for channel 23</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_24</name>
              <description>Enable asynchronous DMA request in stop mode for channel 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_24_0</name>
                  <description>Disable asynchronous DMA request for channel 24</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_24_1</name>
                  <description>Enable asynchronous DMA request for channel 24</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_25</name>
              <description>Enable asynchronous DMA request in stop mode for channel 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_25_0</name>
                  <description>Disable asynchronous DMA request for channel 25</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_25_1</name>
                  <description>Enable asynchronous DMA request for channel 25</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_26</name>
              <description>Enable asynchronous DMA request in stop mode for channel 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_26_0</name>
                  <description>Disable asynchronous DMA request for channel 26</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_26_1</name>
                  <description>Enable asynchronous DMA request for channel 26</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_27</name>
              <description>Enable asynchronous DMA request in stop mode for channel 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_27_0</name>
                  <description>Disable asynchronous DMA request for channel 27</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_27_1</name>
                  <description>Enable asynchronous DMA request for channel 27</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_28</name>
