cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
              <description>Enable asynchronous DMA request in stop mode for channel 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_28_0</name>
                  <description>Disable asynchronous DMA request for channel 28</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_28_1</name>
                  <description>Enable asynchronous DMA request for channel 28</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_29</name>
              <description>Enable asynchronous DMA request in stop mode for channel 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_29_0</name>
                  <description>Disable asynchronous DMA request for channel 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_29_1</name>
                  <description>Enable asynchronous DMA request for channel 29</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_30</name>
              <description>Enable asynchronous DMA request in stop mode for channel 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_30_0</name>
                  <description>Disable asynchronous DMA request for channel 30</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_30_1</name>
                  <description>Enable asynchronous DMA request for channel 30</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_31</name>
              <description>Enable asynchronous DMA request in stop mode for channel 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_31_0</name>
                  <description>Disable asynchronous DMA request for channel 31</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_31_1</name>
                  <description>Enable asynchronous DMA request for channel 31</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI3</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPPRI</name>
              <description>Channel n Current Group Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI2</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x101</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPPRI</name>
              <description>Channel n Current Group Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI1</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x102</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPPRI</name>
              <description>Channel n Current Group Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI0</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x103</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPPRI</name>
              <description>Channel n Current Group Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI7</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPPRI</name>
              <description>Channel n Current Group Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI6</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPPRI</name>
              <description>Channel n Current Group Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI5</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x106</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRPPRI</name>
              <description>Channel n Current Group Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
