cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO5</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x400C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO5_Combined_0_15</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_Combined_16_31</name>
        <value>89</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO2</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401BC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO2_Combined_0_15</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_16_31</name>
        <value>83</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO3</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO3_Combined_0_15</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_Combined_16_31</name>
        <value>85</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO4</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO4_Combined_0_15</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_Combined_16_31</name>
        <value>87</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO6</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x42000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO7</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x42004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO8</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x42008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO1">
      <name>GPIO9</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x4200C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CAN1</name>
      <description>FLEXCAN</description>
      <groupName>CAN</groupName>
      <prependToName>FLEXCAN1_</prependToName>
      <headerStructName>CAN</headerStructName>
      <baseAddress>0x401D0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x9E4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CAN1</name>
        <value>36</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5980000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXMB</name>
              <description>This 7-bit field defines the number of the last Message Buffers that will take part in the matching and arbitration processes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAM</name>
              <description>This 2-bit field identifies the format of the elements of the Rx FIFO filter table, as shown below</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDAM_0</name>
                  <description>Format A One full ID (standard or extended) per ID filter Table element.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAM_1</name>
                  <description>Format B Two full standard IDs or two partial 14-bit extended IDs per ID filter Table element.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAM_2</name>
                  <description>Format C Four partial 8-bit IDs (standard or extended) per ID filter Table element.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAM_3</name>
                  <description>Format D All frames rejected.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEN</name>
              <description>This bit is supplied for backwards compatibility reasons</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AEN_0</name>
                  <description>Abort disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AEN_1</name>
                  <description>Abort enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPRIOEN</name>
              <description>This bit is provided for backwards compatibility reasons</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPRIOEN_0</name>
                  <description>Local Priority disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPRIOEN_1</name>
                  <description>Local Priority enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRMQ</name>
              <description>This bit indicates whether Rx matching process will be based either on individual masking and queue or on masking scheme with RXMGMASK, RX14MASK and RX15MASK, RXFGMASK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRMQ_0</name>
                  <description>Individual Rx masking and queue feature are disabled.For backward compatibility, the reading of C/S word locks the MB even if it is EMPTY.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRMQ_1</name>
                  <description>Individual Rx masking and queue feature are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRXDIS</name>
              <description>This bit defines whether FlexCAN is allowed to receive frames transmitted by itself</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRXDIS_0</name>
                  <description>Self reception enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRXDIS_1</name>
                  <description>Self reception disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKSRC</name>
              <description>This bit defines whether the integrated low-pass filter is applied to protect the FLEXCAN_RX input from spurious wake up</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKSRC_0</name>
                  <description>FLEXCAN uses the unfiltered FLEXCAN_RX input to detect recessive to dominant edges on the CAN bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKSRC_1</name>
                  <description>FLEXCAN uses the filtered FLEXCAN_RX input to detect recessive to dominant edges on the CAN bus</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMACK</name>
              <description>This read-only bit indicates that FLEXCAN is either in Disable Mode or Stop Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMACK_0</name>
                  <description>FLEXCAN not in any of the low power modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMACK_1</name>
                  <description>FLEXCAN is either in Disable Mode, or Stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRNEN</name>
              <description>When asserted, this bit enables the generation of the TWRN_INT and RWRN_INT flags in the Error and Status Register</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRNEN_0</name>
                  <description>TWRN_INT and RWRN_INT bits are zero, independent of the values in the error counters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRNEN_1</name>
                  <description>TWRN_INT and RWRN_INT bits are set when the respective error counter transition from &lt;96 to &gt;= 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLFWAK</name>
              <description>This bit enables the Self Wake Up feature when FLEXCAN is in Stop Mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLFWAK_0</name>
                  <description>FLEXCAN Self Wake Up feature is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLFWAK_1</name>
                  <description>FLEXCAN Self Wake Up feature is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPV</name>
              <description>This bit configures some of the FLEXCAN registers to be either in Supervisor or User Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPV_0</name>
                  <description>FlexCAN is in User Mode. Affected registers allow both Supervisor and Unrestricted accesses</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPV_1</name>
                  <description>FlexCAN is in Supervisor Mode. Affected registers allow only Supervisor access. Unrestricted access behaves as though the access was done to an unimplemented register location</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRZACK</name>
              <description>This read-only bit indicates that FLEXCAN is in Freeze Mode and its prescaler is stopped</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRZACK_0</name>
                  <description>FLEXCAN not in Freeze Mode, prescaler running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRZACK_1</name>
                  <description>FLEXCAN in Freeze Mode, prescaler stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFTRST</name>
              <description>When this bit is asserted, FlexCAN resets its internal state machines and some of the memory mapped registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFTRST_0</name>
                  <description>No reset request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTRST_1</name>
                  <description>Reset the registers</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKMSK</name>
              <description>This bit enables the Wake Up Interrupt generation.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKMSK_0</name>
                  <description>Wake Up Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKMSK_1</name>
                  <description>Wake Up Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTRDY</name>
              <description>This read-only bit indicates that FLEXCAN is either in Disable Mode, Stop Mode or Freeze Mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTRDY_0</name>
                  <description>FLEXCAN module is either in Normal Mode, Listen-Only Mode or Loop-Back Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTRDY_1</name>
                  <description>FLEXCAN module is either in Disable Mode, Stop Mode or Freeze Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Assertion of this bit puts the FLEXCAN module into Freeze Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALT_0</name>
                  <description>No Freeze Mode request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_1</name>
                  <description>Enters Freeze Mode if the FRZ bit is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFEN</name>
              <description>This bit controls whether the Rx FIFO feature is enabled or not</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFEN_0</name>
                  <description>FIFO not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEN_1</name>
                  <description>FIFO enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRZ</name>
              <description>The FRZ bit specifies the FLEXCAN behavior when the HALT bit in the MCR Register is set or when Debug Mode is requested at Arm level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRZ_0</name>
                  <description>Not enabled to enter Freeze Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRZ_1</name>
                  <description>Enabled to enter Freeze Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIS</name>
              <description>This bit controls whether FLEXCAN is enabled or not</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDIS_0</name>
                  <description>Enable the FLEXCAN module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDIS_1</name>
                  <description>Disable the FLEXCAN module</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
