cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>ESR1</name>
          <description>Error and Status 1 Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAKINT</name>
              <description>When FLEXCAN is Stop Mode and a recessive to dominant transition is detected on the CAN bus and if the WAK_MSK bit in the MCR Register is set, an interrupt is generated to the Arm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKINT_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKINT_1</name>
                  <description>Indicates a recessive to dominant transition received on the CAN bus when the FLEXCAN module is in Stop Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRINT</name>
              <description>This bit indicates that at least one of the Error Bits (bits 15-10) is set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERRINT_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERRINT_1</name>
                  <description>Indicates setting of any Error Bit in the Error and Status Register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOFFINT</name>
              <description>This bit is set when FLEXCAN enters 'Bus Off' state</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOFFINT_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOFFINT_1</name>
                  <description>FLEXCAN module entered 'Bus Off' state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>This bit indicates if FlexCAN is receiving a message. Refer to .</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_0</name>
                  <description>FLEXCAN is receiving a message</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_1</name>
                  <description>FLEXCAN is transmitting a message</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTCONF</name>
              <description>If the LOM bit in the Control Register is asserted, after some delay that depends on the CAN bit timing the FLT_CONF field will indicate &quot;Error Passive&quot;</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLTCONF_0</name>
                  <description>Error Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLTCONF_1</name>
                  <description>Error Passive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLTCONF_2</name>
                  <description>Bus off</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>This bit indicates if FLEXCAN is transmitting a message.Refer to .</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_0</name>
                  <description>FLEXCAN is receiving a message</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_1</name>
                  <description>FLEXCAN is transmitting a message</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>This bit indicates when CAN bus is in IDLE state.Refer to .</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_1</name>
                  <description>CAN bus is now IDLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXWRN</name>
              <description>This bit indicates when repetitive errors are occurring during message reception.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXWRN_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWRN_1</name>
                  <description>Rx_Err_Counter &gt;= 96</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXWRN</name>
              <description>This bit indicates when repetitive errors are occurring during message transmission.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXWRN_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWRN_1</name>
                  <description>TX_Err_Counter &gt;= 96</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STFERR</name>
              <description>This bit indicates that a Stuffing Error has been detected.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STFERR_0</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STFERR_1</name>
                  <description>A Stuffing Error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMERR</name>
              <description>This bit indicates that a Form Error has been detected by the receiver node, i</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRMERR_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRMERR_1</name>
                  <description>A Form Error occurred since last read of this register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCERR</name>
              <description>This bit indicates that a CRC Error has been detected by the receiver node, i</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRCERR_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCERR_1</name>
                  <description>A CRC error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKERR</name>
              <description>This bit indicates that an Acknowledge Error has been detected by the transmitter node, i</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACKERR_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKERR_1</name>
                  <description>An ACK error occurred since last read of this register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT0ERR</name>
              <description>This bit indicates when an inconsistency occurs between the transmitted and the received bit in a message</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT0ERR_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT0ERR_1</name>
                  <description>At least one bit sent as dominant is received as recessive</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT1ERR</name>
              <description>This bit indicates when an inconsistency occurs between the transmitted and the received bit in a message</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT1ERR_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT1ERR_1</name>
                  <description>At least one bit sent as recessive is received as dominant</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWRNINT</name>
              <description>If the WRN_EN bit in MCR is asserted, the RWRN_INT bit is set when the RX_WRN flag transition from '0' to '1', meaning that the Rx error counters reached 96</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWRNINT_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWRNINT_1</name>
                  <description>The Rx error counter transition from &lt; 96 to &gt;= 96</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWRNINT</name>
              <description>If the WRN_EN bit in MCR is asserted, the TWRN_INT bit is set when the TX_WRN flag transition from '0' to '1', meaning that the Tx error counter reached 96</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWRNINT_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWRNINT_1</name>
                  <description>The Tx error counter transition from &lt; 96 to &gt;= 96</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCH</name>
              <description>This read-only flag indicates whether the FlexCAN is synchronized to the CAN bus and able to participate in the communication process</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCH_0</name>
                  <description>FlexCAN is not synchronized to the CAN bus</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCH_1</name>
                  <description>FlexCAN is synchronized to the CAN bus</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMASK2</name>
          <description>Interrupt Masks 2 Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUFHM</name>
              <description>Each bit enables or disables the respective FLEXCAN Message Buffer (MB32 to MB63) Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFHM_0</name>
                  <description>The corresponding buffer Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFHM_1</name>
                  <description>The corresponding buffer Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMASK1</name>
          <description>Interrupt Masks 1 Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUFLM</name>
              <description>Each bit enables or disables the respective FLEXCAN Message Buffer (MB0 to MB31) Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFLM_0</name>
                  <description>The corresponding buffer Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFLM_1</name>
                  <description>The corresponding buffer Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IFLAG2</name>
          <description>Interrupt Flags 2 Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUFHI</name>
              <description>Each bit flags the respective FLEXCAN Message Buffer (MB32 to MB63) interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFHI_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFHI_1</name>
                  <description>The corresponding buffer has successfully completed transmission or reception</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
