cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN1">
      <name>CAN2</name>
      <description>FLEXCAN</description>
      <groupName>CAN</groupName>
      <prependToName>FLEXCAN2_</prependToName>
      <baseAddress>0x401D4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x9E4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CAN2</name>
        <value>37</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CAN3</name>
      <description>CAN</description>
      <groupName>CAN</groupName>
      <baseAddress>0x401D8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CAN3</name>
        <value>154</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5980000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXMB</name>
              <description>Number Of The Last Message Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAM</name>
              <description>ID Acceptance Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDAM_0</name>
                  <description>Format A: One full ID (standard and extended) per ID Filter Table element.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAM_1</name>
                  <description>Format B: Two full standard IDs or two partial 14-bit (standard and extended) IDs per ID Filter Table element.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAM_2</name>
                  <description>Format C: Four partial 8-bit Standard IDs per ID Filter Table element.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAM_3</name>
                  <description>Format D: All frames rejected.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDEN</name>
              <description>CAN FD operation enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDEN_0</name>
                  <description>CAN FD is disabled. FlexCAN is able to receive and transmit messages in CAN 2.0 format.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDEN_1</name>
                  <description>CAN FD is enabled. FlexCAN is able to receive and transmit messages in both CAN FD and CAN 2.0 formats.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEN</name>
              <description>Abort Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AEN_0</name>
                  <description>Abort disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AEN_1</name>
                  <description>Abort enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPRIOEN</name>
              <description>Local Priority Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPRIOEN_0</name>
                  <description>Local Priority disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPRIOEN_1</name>
                  <description>Local Priority enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>DMA Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_0</name>
                  <description>DMA feature for Legacy RX FIFO or Enhanced Rx FIFO are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_1</name>
                  <description>DMA feature for Legacy RX FIFO or Enhanced Rx FIFO are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRMQ</name>
              <description>Individual Rx Masking And Queue Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IRMQ_0</name>
                  <description>Individual Rx masking and queue feature are disabled. For backward compatibility with legacy applications, the reading of C/S word locks the MB even if it is EMPTY.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRMQ_1</name>
                  <description>Individual Rx masking and queue feature are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRXDIS</name>
              <description>Self Reception Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRXDIS_0</name>
                  <description>Self reception enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRXDIS_1</name>
                  <description>Self reception disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZE</name>
              <description>Doze Mode Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOZE_0</name>
                  <description>FlexCAN is not enabled to enter low-power mode when Doze mode is requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOZE_1</name>
                  <description>FlexCAN is enabled to enter low-power mode when Doze mode is requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKSRC</name>
              <description>Wake Up Source</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKSRC_0</name>
                  <description>FlexCAN uses the unfiltered Rx input to detect recessive to dominant edges on the CAN bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKSRC_1</name>
                  <description>FlexCAN uses the filtered Rx input to detect recessive to dominant edges on the CAN bus.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMACK</name>
              <description>Low-Power Mode Acknowledge</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMACK_0</name>
                  <description>FlexCAN is not in a low-power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMACK_1</name>
                  <description>FlexCAN is in a low-power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRNEN</name>
              <description>Warning Interrupt Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRNEN_0</name>
                  <description>TWRNINT and RWRNINT bits are zero, independent of the values in the error counters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRNEN_1</name>
                  <description>TWRNINT and RWRNINT bits are set when the respective error counter transitions from less than 96 to greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLFWAK</name>
              <description>Self Wake Up</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLFWAK_0</name>
                  <description>FlexCAN Self Wake Up feature is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLFWAK_1</name>
                  <description>FlexCAN Self Wake Up feature is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPV</name>
              <description>Supervisor Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPV_0</name>
                  <description>FlexCAN is in User mode. Affected registers allow both Supervisor and Unrestricted accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPV_1</name>
                  <description>FlexCAN is in Supervisor mode. Affected registers allow only Supervisor access. Unrestricted access behaves as though the access was done to an unimplemented register location.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRZACK</name>
              <description>Freeze Mode Acknowledge</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRZACK_0</name>
                  <description>FlexCAN not in Freeze mode, prescaler running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRZACK_1</name>
                  <description>FlexCAN in Freeze mode, prescaler stopped.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFTRST</name>
              <description>Soft Reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFTRST_0</name>
                  <description>No reset request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTRST_1</name>
                  <description>Resets the registers affected by soft reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKMSK</name>
              <description>Wake Up Interrupt Mask</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKMSK_0</name>
                  <description>Wake Up Interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKMSK_1</name>
                  <description>Wake Up Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTRDY</name>
              <description>FlexCAN Not Ready</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTRDY_0</name>
                  <description>FlexCAN module is either in Normal mode, Listen-Only mode or Loop-Back mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTRDY_1</name>
                  <description>FlexCAN module is either in Disable mode, Doze mode , Stop mode or Freeze mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt FlexCAN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALT_0</name>
                  <description>No Freeze mode request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_1</name>
                  <description>Enters Freeze mode if the FRZ bit is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFEN</name>
              <description>Legacy Rx FIFO Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFEN_0</name>
                  <description>Legacy Rx FIFO not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEN_1</name>
                  <description>Legacy Rx FIFO enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRZ</name>
              <description>Freeze Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRZ_0</name>
                  <description>Not enabled to enter Freeze mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRZ_1</name>
                  <description>Enabled to enter Freeze mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDIS_0</name>
                  <description>Enable the FlexCAN module.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDIS_1</name>
                  <description>Disable the FlexCAN module.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
