cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>EDCBT</name>
          <description>Enhanced Data Phase CAN bit Timing</description>
          <addressOffset>0xBF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTSEG1</name>
              <description>Data Phase Segment 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data Phase Time Segment 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRJW</name>
              <description>Data Phase Resynchronization Jump Width</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETDC</name>
          <description>Enhanced Transceiver Delay Compensation</description>
          <addressOffset>0xBFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ETDCVAL</name>
              <description>Enhanced Transceiver Delay Compensation Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETDCOFF</name>
              <description>Enhanced Transceiver Delay Compensation Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDMDIS</name>
              <description>Transceiver Delay Measurement Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDMDIS_0</name>
                  <description>TDC measurement is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDMDIS_1</name>
                  <description>TDC measurement is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCTRL</name>
          <description>CAN FD Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDCVAL</name>
              <description>Transceiver Delay Compensation Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TDCOFF</name>
              <description>Transceiver Delay Compensation Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCFAIL</name>
              <description>Transceiver Delay Compensation Fail</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDCFAIL_0</name>
                  <description>Measured loop delay is in range.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDCFAIL_1</name>
                  <description>Measured loop delay is out of range.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDCEN</name>
              <description>Transceiver Delay Compensation Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDCEN_0</name>
                  <description>TDC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDCEN_1</name>
                  <description>TDC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBDSR0</name>
              <description>Message Buffer Data Size for Region 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MBDSR0_0</name>
                  <description>Selects 8 bytes per Message Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBDSR0_1</name>
                  <description>Selects 16 bytes per Message Buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBDSR0_2</name>
                  <description>Selects 32 bytes per Message Buffer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBDSR0_3</name>
                  <description>Selects 64 bytes per Message Buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBDSR1</name>
              <description>Message Buffer Data Size for Region 1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MBDSR1_0</name>
                  <description>Selects 8 bytes per Message Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBDSR1_1</name>
                  <description>Selects 16 bytes per Message Buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBDSR1_2</name>
                  <description>Selects 32 bytes per Message Buffer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBDSR1_3</name>
                  <description>Selects 64 bytes per Message Buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDRATE</name>
              <description>Bit Rate Switch Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDRATE_0</name>
                  <description>Transmit a frame in nominal rate. The BRS bit in the Tx MB has no effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDRATE_1</name>
                  <description>Transmit a frame with bit rate switching if the BRS bit in the Tx MB is recessive.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCBT</name>
          <description>CAN FD Bit Timing Register</description>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPSEG2</name>
              <description>Fast Phase Segment 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPSEG1</name>
              <description>Fast Phase Segment 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPROPSEG</name>
              <description>Fast Propagation Segment</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRJW</name>
              <description>Fast Resync Jump Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPRESDIV</name>
              <description>Fast Prescaler Division Factor</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCRC</name>
          <description>CAN FD CRC Register</description>
          <addressOffset>0xC08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FD_TXCRC</name>
              <description>Extended Transmitted CRC value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FD_MBCRC</name>
              <description>CRC Mailbox Number for FD_TXCRC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERFCR</name>
          <description>Enhanced Rx FIFO Control Register</description>
          <addressOffset>0xC0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERFWM</name>
              <description>Enhanced Rx FIFO Watermark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NFE</name>
              <description>Number of Enhanced Rx FIFO Filter Elements</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXIF</name>
              <description>Number of Extended ID Filter Elements</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALW</name>
              <description>DMA Last Word</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERFEN</name>
              <description>Enhanced Rx FIFO enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFEN_0</name>
                  <description>Enhanced Rx FIFO is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFEN_1</name>
                  <description>Enhanced Rx FIFO is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERFIER</name>
          <description>Enhanced Rx FIFO Interrupt Enable register</description>
          <addressOffset>0xC10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERFDAIE</name>
              <description>Enhanced Rx FIFO Data Available Interrupt Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFDAIE_0</name>
                  <description>Enhanced Rx FIFO Data Available Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFDAIE_1</name>
                  <description>Enhanced Rx FIFO Data Available Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFWMIIE</name>
              <description>Enhanced Rx FIFO Watermark Indication Interrupt Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFWMIIE_0</name>
                  <description>Enhanced Rx FIFO Watermark Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFWMIIE_1</name>
                  <description>Enhanced Rx FIFO Watermark Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFOVFIE</name>
              <description>Enhanced Rx FIFO Overflow Interrupt Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFOVFIE_0</name>
                  <description>Enhanced Rx FIFO Overflow is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFOVFIE_1</name>
                  <description>Enhanced Rx FIFO Overflow is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFUFWIE</name>
              <description>Enhanced Rx FIFO Underflow Interrupt Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFUFWIE_0</name>
                  <description>Enhanced Rx FIFO Underflow interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFUFWIE_1</name>
                  <description>Enhanced Rx FIFO Underflow interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERFSR</name>
          <description>Enhanced Rx FIFO Status Register</description>
          <addressOffset>0xC14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERFEL</name>
              <description>Enhanced Rx FIFO Elements</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERFF</name>
              <description>Enhanced Rx FIFO full</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFF_0</name>
                  <description>Enhanced Rx FIFO is not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFF_1</name>
                  <description>Enhanced Rx FIFO is full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFE</name>
              <description>Enhanced Rx FIFO empty</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFE_0</name>
                  <description>Enhanced Rx FIFO is not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFE_1</name>
                  <description>Enhanced Rx FIFO is empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFCLR</name>
              <description>Enhanced Rx FIFO Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFCLR_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFCLR_1</name>
                  <description>Clear Enhanced Rx FIFO content</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFDA</name>
              <description>Enhanced Rx FIFO Data Available</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFDA_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFDA_1</name>
                  <description>There is at least one message stored in Enhanced Rx FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFWMI</name>
              <description>Enhanced Rx FIFO Watermark Indication</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFWMI_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFWMI_1</name>
                  <description>The number of messages in FIFO is greater than the watermark</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFOVF</name>
              <description>Enhanced Rx FIFO Overflow</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFOVF_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFOVF_1</name>
                  <description>Enhanced Rx FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERFUFW</name>
              <description>Enhanced Rx FIFO Underflow</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERFUFW_0</name>
                  <description>No such occurrence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERFUFW_1</name>
                  <description>Enhanced Rx FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
