cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLEXSPI</name>
      <description>FlexSPI</description>
      <groupName>FlexSPI</groupName>
      <headerStructName>FlexSPI</headerStructName>
      <baseAddress>0x402A8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXSPI</name>
        <value>108</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR0</name>
          <description>Module Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF80C2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWRESET</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCLKSRC</name>
              <description>Sample Clock source selection for Flash Reading</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXCLKSRC_0</name>
                  <description>Dummy Read strobe generated by FlexSPI Controller and loopback internally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXCLKSRC_1</name>
                  <description>Dummy Read strobe generated by FlexSPI Controller and loopback from DQS pad.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXCLKSRC_3</name>
                  <description>Flash provided Read strobe and input from DQS pad</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARDFEN</name>
              <description>Enable AHB bus Read Access to IP RX FIFO.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARDFEN_0</name>
                  <description>IP RX FIFO should be read by IP Bus. AHB Bus read access to IP RX FIFO memory space will get bus error response.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARDFEN_1</name>
                  <description>IP RX FIFO should be read by AHB Bus. IP Bus read access to IP RX FIFO memory space will always return data zero but no bus error response.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATDFEN</name>
              <description>Enable AHB bus Write Access to IP TX FIFO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ATDFEN_0</name>
                  <description>IP TX FIFO should be written by IP Bus. AHB Bus write access to IP TX FIFO memory space will get bus error response.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATDFEN_1</name>
                  <description>IP TX FIFO should be written by AHB Bus. IP Bus write access to IP TX FIFO memory space will be ignored but no bus error response.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSEN</name>
              <description>Half Speed Serial Flash access Enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSEN_0</name>
                  <description>Disable divide by 2 of serial flash clock for half speed commands.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSEN_1</name>
                  <description>Enable divide by 2 of serial flash clock for half speed commands.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEEN</name>
              <description>Doze mode enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOZEEN_0</name>
                  <description>Doze mode support disabled. AHB clock and serial clock will not be gated off when there is doze mode request from system.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOZEEN_1</name>
                  <description>Doze mode support enabled. AHB clock and serial clock will be gated off when there is doze mode request from system.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMBINATIONEN</name>
              <description>This bit is to support Flash Octal mode access by combining Port A and B Data pins (SIOA[3:0] and SIOB[3:0]).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMBINATIONEN_0</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMBINATIONEN_1</name>
                  <description>Enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCKFREERUNEN</name>
              <description>This bit is used to force SCK output free-running. For FPGA applications, external device may use SCK clock as reference clock to its internal PLL. If SCK free-running is enabled, data sampling with loopback clock from SCK pad is not supported (MCR0[RXCLKSRC]=2).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCKFREERUNEN_0</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKFREERUNEN_1</name>
                  <description>Enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPGRANTWAIT</name>
              <description>Time out wait cycle for IP command grant.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBGRANTWAIT</name>
              <description>Timeout wait cycle for AHB command grant.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR1</name>
          <description>Module Control Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHBBUSWAIT</name>
              <description>AHB Read/Write access to Serial Flash Memory space will timeout if not data received from Flash or data not transmited after AHBBUSWAIT * 1024 ahb clock cycles, AHB Bus will get an error response</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQWAIT</name>
              <description>Command Sequence Execution will timeout and abort after SEQWAIT * 1024 Serial Root Clock cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR2</name>
          <description>Module Control Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200081F7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRAHBBUFOPT</name>
              <description>This bit determines whether AHB RX Buffer and AHB TX Buffer will be cleaned automaticaly when FlexSPI returns STOP mode ACK. Software should set this bit if AHB RX Buffer or AHB TX Buffer will be powered off in STOP mode. Otherwise AHB read access after exiting STOP mode may hit AHB RX Buffer or AHB TX Buffer but their data entries are invalid.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRAHBBUFOPT_0</name>
                  <description>AHB RX/TX Buffer will not be cleaned automatically when FlexSPI return Stop mode ACK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRAHBBUFOPT_1</name>
                  <description>AHB RX/TX Buffer will be cleaned automatically when FlexSPI return Stop mode ACK.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRLEARNPHASE</name>
              <description>The sampling clock phase selection will be reset to phase 0 when this bit is written with 0x1. This bit will be auto-cleared immediately.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMEDEVICEEN</name>
              <description>All external devices are same devices (both in types and size) for A1/A2/B1/B2.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMEDEVICEEN_0</name>
                  <description>In Individual mode, FLSHA1CRx/FLSHA2CRx/FLSHB1CRx/FLSHB2CRx register setting will be applied to Flash A1/A2/B1/B2 seperately. In Parallel mode, FLSHA1CRx register setting will be applied to Flash A1 and B1, FLSHA2CRx register setting will be applied to Flash A2 and B2. FLSHB1CRx/FLSHB2CRx register settings will be ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMEDEVICEEN_1</name>
                  <description>FLSHA1CR0/FLSHA1CR1/FLSHA1CR2 register settings will be applied to Flash A1/A2/B1/B2. FLSHA2CRx/FLSHB1CRx/FLSHB2CRx will be ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCKBDIFFOPT</name>
              <description>SCKB pad can be used as SCKA differential clock output (inverted clock to SCKA). In this case, port B flash access is not available. After change the value of this feild, MCR0[SWRESET] should be set.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCKBDIFFOPT_0</name>
                  <description>SCKB pad is used as port B SCK clock output. Port B flash access is available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKBDIFFOPT_1</name>
                  <description>SCKB pad is used as port A SCK inverted clock output (Differential clock to SCKA). Port B flash access is not available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESUMEWAIT</name>
              <description>Wait cycle (in AHB clock cycle) for idle state before suspended command sequence resumed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBCR</name>
          <description>AHB Bus Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APAREN</name>
              <description>Parallel mode enabled for AHB triggered Command (both read and write) .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APAREN_0</name>
                  <description>Flash will be accessed in Individual mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APAREN_1</name>
                  <description>Flash will be accessed in Parallel mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHABLEEN</name>
              <description>Enable AHB bus cachable read access support.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CACHABLEEN_0</name>
                  <description>Disabled. When there is AHB bus cachable read access, FlexSPI will not check whether it hit AHB TX Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHABLEEN_1</name>
                  <description>Enabled. When there is AHB bus cachable read access, FlexSPI will check whether it hit AHB TX Buffer first.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFFERABLEEN</name>
              <description>Enable AHB bus bufferable write access support. This field affects the last beat of AHB write access, refer for more details about AHB bufferable write.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFFERABLEEN_0</name>
                  <description>Disabled. For all AHB write access (no matter bufferable or non-bufferable ), FlexSPI will return AHB Bus ready after all data is transmitted to External device and AHB command finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFERABLEEN_1</name>
                  <description>Enabled. For AHB bufferable write access, FlexSPI will return AHB Bus ready when the AHB command is granted by arbitrator and will not wait for AHB command finished.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREFETCHEN</name>
              <description>AHB Read Prefetch Enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READADDROPT</name>
              <description>AHB Read Address option bit. This option bit is intend to remove AHB burst start address alignment limitation.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READADDROPT_0</name>
                  <description>There is AHB read burst start address alignment limitation when flash is accessed in parallel mode or flash is wordaddressable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READADDROPT_1</name>
                  <description>There is no AHB read burst start address alignment limitation. FlexSPI will fetch more datas than AHB burst required to meet the alignment requirement.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPCMDDONEEN</name>
              <description>IP triggered Command Sequences Execution finished interrupt enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPCMDGEEN</name>
              <description>IP triggered Command Sequences Grant Timeout interrupt enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBCMDGEEN</name>
              <description>AHB triggered Command Sequences Grant Timeout interrupt enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPCMDERREN</name>
              <description>IP triggered Command Sequences Error Detected interrupt enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBCMDERREN</name>
              <description>AHB triggered Command Sequences Error Detected interrupt enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPRXWAEN</name>
              <description>IP RX FIFO WaterMark available interrupt enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPTXWEEN</name>
              <description>IP TX FIFO WaterMark empty interrupt enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCKSTOPBYRDEN</name>
              <description>SCK is stopped during command sequence because Async RX FIFO full interrupt enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCKSTOPBYWREN</name>
              <description>SCK is stopped during command sequence because Async TX FIFO empty interrupt enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBBUSTIMEOUTEN</name>
              <description>AHB Bus timeout interrupt.Refer Interrupts chapter for more details.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQTIMEOUTEN</name>
              <description>Sequence execution timeout interrupt enable.Refer Interrupts chapter for more details.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
