cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>PS_CTRL_TOG</name>
          <description>Processed Surface (PS) Control Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>PS buffer format. To select between YUV and YCbCr formats, see bit 31 of the CSC1_COEF0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>32-bit pixels (unpacked 24-bit format)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB555</name>
                  <description>16-bit pixels</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB444</name>
                  <description>16-bit pixels</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>16-bit pixels</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV1P444</name>
                  <description>32-bit pixels (1-plane XYUV unpacked)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UYVY1P422</name>
                  <description>16-bit pixels (1-plane U0,Y0,V0,Y1 interleaved bytes)</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VYUY1P422</name>
                  <description>16-bit pixels (1-plane V0,Y0,U0,Y1 interleaved bytes)</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y8</name>
                  <description>8-bit monochrome pixels (1-plane Y luma output)</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y4</name>
                  <description>4-bit monochrome pixels (1-plane Y luma, 4 bit truncation)</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P422</name>
                  <description>16-bit pixels (2-plane UV interleaved bytes)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P420</name>
                  <description>16-bit pixels (2-plane UV)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P422</name>
                  <description>16-bit pixels (2-plane VU interleaved bytes)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P420</name>
                  <description>16-bit pixels (2-plane VU)</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV422</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV420</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB_SWAP</name>
              <description>Swap bytes in words. For each 16 bit word, the two bytes will be swapped.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD0</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECY</name>
              <description>Verticle pre decimation filter control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECX</name>
              <description>Horizontal pre decimation filter control.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_BUF</name>
          <description>PS Input Buffer Address</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address pointer for the PS RGB or Y (luma) input buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_UBUF</name>
          <description>PS U/Cb or 2 Plane UV Input Buffer Address</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address pointer for the PS U/Cb or 2 plane UV Chroma input buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_VBUF</name>
          <description>PS V/Cr Input Buffer Address</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address pointer for the PS V/Cr Chroma input buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_PITCH</name>
          <description>Processed Surface Pitch</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Indicates the number of bytes in memory between two vertically adjacent pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_BACKGROUND</name>
          <description>PS Background Color</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLOR</name>
              <description>Background color (in 24bpp format) for any pixels not within the buffer range specified by the PS ULC/LRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_SCALE</name>
          <description>PS Scale Factor Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XSCALE</name>
              <description>This is a two bit integer and 12 bit fractional representation (##</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YSCALE</name>
              <description>This is a two bit integer and 12 bit fractional representation (##</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD2</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_OFFSET</name>
          <description>PS Scale Offset Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XOFFSET</name>
              <description>This is a 12 bit fractional representation (0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YOFFSET</name>
              <description>This is a 12 bit fractional representation (0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD2</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_CLRKEYLOW</name>
          <description>PS Color Key Low</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL</name>
              <description>Low range of color key applied to PS buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_CLRKEYHIGH</name>
          <description>PS Color Key High</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL</name>
              <description>High range of color key applied to PS buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
