cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>PRES_STATE</name>
          <description>Present State</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8080</resetValue>
          <resetMask>0x72FFFF</resetMask>
          <fields>
            <field>
              <name>CIHB</name>
              <description>Command Inhibit (CMD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIHB_0</name>
                  <description>Can issue command using only CMD line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIHB_1</name>
                  <description>Cannot issue command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDIHB</name>
              <description>Command Inhibit (DATA)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDIHB_0</name>
                  <description>Can issue command which uses the DATA line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIHB_1</name>
                  <description>Cannot issue command which uses the DATA line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLA</name>
              <description>Data Line Active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLA_0</name>
                  <description>DATA Line Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLA_1</name>
                  <description>DATA Line Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDSTB</name>
              <description>SD Clock Stable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDSTB_0</name>
                  <description>Clock is changing frequency and not stable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDSTB_1</name>
                  <description>Clock is stable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPGOFF</name>
              <description>IPG_CLK Gated Off Internally</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPGOFF_0</name>
                  <description>IPG_CLK is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPGOFF_1</name>
                  <description>IPG_CLK is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCKOFF</name>
              <description>HCLK Gated Off Internally</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCKOFF_0</name>
                  <description>HCLK is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCKOFF_1</name>
                  <description>HCLK is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEROFF</name>
              <description>IPG_PERCLK Gated Off Internally</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEROFF_0</name>
                  <description>IPG_PERCLK is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEROFF_1</name>
                  <description>IPG_PERCLK is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDOFF</name>
              <description>SD Clock Gated Off Internally</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDOFF_0</name>
                  <description>SD Clock is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDOFF_1</name>
                  <description>SD Clock is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTA</name>
              <description>Write Transfer Active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WTA_0</name>
                  <description>No valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WTA_1</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTA</name>
              <description>Read Transfer Active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTA_0</name>
                  <description>No valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTA_1</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWEN</name>
              <description>Buffer Write Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BWEN_0</name>
                  <description>Write disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWEN_1</name>
                  <description>Write enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BREN</name>
              <description>Buffer Read Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BREN_0</name>
                  <description>Read disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREN_1</name>
                  <description>Read enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTR</name>
              <description>Re-Tuning Request (only for SD3.0 SDR104 mode and EMMC HS200 mode)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTR_0</name>
                  <description>Fixed or well tuned sampling clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTR_1</name>
                  <description>Sampling clock needs re-tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSCD</name>
              <description>Tape Select Change Done</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSCD_0</name>
                  <description>Delay cell select change is not finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSCD_1</name>
                  <description>Delay cell select change is finished.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINST</name>
              <description>Card Inserted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CINST_0</name>
                  <description>Power on Reset or No Card</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CINST_1</name>
                  <description>Card Inserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDPL</name>
              <description>Card Detect Pin Level</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDPL_0</name>
                  <description>No card present (CD_B = 1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDPL_1</name>
                  <description>Card present (CD_B = 0)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPSPL</name>
              <description>Write Protect Switch Pin Level</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPSPL_0</name>
                  <description>Write protected (WP = 1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPSPL_1</name>
                  <description>Write enabled (WP = 0)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLSL</name>
              <description>CMD Line Signal Level</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLSL</name>
              <description>DATA[7:0] Line Signal Level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>Data 0 line signal level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>Data 1 line signal level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Data 2 line signal level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA3</name>
                  <description>Data 3 line signal level</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA4</name>
                  <description>Data 4 line signal level</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA5</name>
                  <description>Data 5 line signal level</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA6</name>
                  <description>Data 6 line signal level</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA7</name>
                  <description>Data 7 line signal level</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
