cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>TCR</name>
          <description>Transmit Control Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTS</name>
              <description>Graceful Transmit Stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDEN</name>
              <description>Full-Duplex Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFC_PAUSE</name>
              <description>Transmit Frame Control Pause</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TFC_PAUSE_0</name>
                  <description>No PAUSE frame transmitted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TFC_PAUSE_1</name>
                  <description>The MAC stops transmission of data frames after the current transmission is complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFC_PAUSE</name>
              <description>Receive Frame Control Pause</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDSEL</name>
              <description>Source MAC Address Select On Transmit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDSEL_0</name>
                  <description>Node MAC address programmed on PADDR1/2 registers.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDINS</name>
              <description>Set MAC Address On Transmit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDINS_0</name>
                  <description>The source MAC address is not modified by the MAC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDINS_1</name>
                  <description>The MAC overwrites the source MAC address with the programmed MAC address according to ADDSEL.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCFWD</name>
              <description>Forward Frame From Application With CRC</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRCFWD_0</name>
                  <description>TxBD[TC] controls whether the frame has a CRC from the application.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCFWD_1</name>
                  <description>The transmitter does not append any CRC to transmitted frames, as it is expecting a frame with CRC from the application.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PALR</name>
          <description>Physical Address Lower Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PADDR1</name>
              <description>Pause Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUR</name>
          <description>Physical Address Upper Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Type Field In PAUSE Frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PADDR2</name>
              <description>Bytes 4 (bits 31:24) and 5 (bits 23:16) of the 6-byte individual address used for exact match, and the source address field in PAUSE frames</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPD</name>
          <description>Opcode/Pause Duration Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PAUSE_DUR</name>
              <description>Pause Duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPCODE</name>
              <description>Opcode Field In PAUSE Frames</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIC</name>
          <description>Transmit Interrupt Coalescing Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICTT</name>
              <description>Interrupt coalescing timer threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICFT</name>
              <description>Interrupt coalescing frame count threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICCS</name>
              <description>Interrupt Coalescing Timer Clock Source Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ICCS_0</name>
                  <description>Use MII/GMII TX clocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICCS_1</name>
                  <description>Use ENET system clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICEN</name>
              <description>Interrupt Coalescing Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ICEN_0</name>
                  <description>Disable Interrupt coalescing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICEN_1</name>
                  <description>Enable Interrupt coalescing.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIC</name>
          <description>Receive Interrupt Coalescing Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICTT</name>
              <description>Interrupt coalescing timer threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICFT</name>
              <description>Interrupt coalescing frame count threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICCS</name>
              <description>Interrupt Coalescing Timer Clock Source Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ICCS_0</name>
                  <description>Use MII/GMII TX clocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICCS_1</name>
                  <description>Use ENET system clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICEN</name>
              <description>Interrupt Coalescing Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ICEN_0</name>
                  <description>Disable Interrupt coalescing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICEN_1</name>
                  <description>Enable Interrupt coalescing.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IAUR</name>
          <description>Descriptor Individual Upper Address Register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IADDR1</name>
              <description>Contains the upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IALR</name>
          <description>Descriptor Individual Lower Address Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IADDR2</name>
              <description>Contains the lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a unicast address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAUR</name>
          <description>Descriptor Group Upper Address Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GADDR1</name>
              <description>Contains the upper 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GALR</name>
          <description>Descriptor Group Lower Address Register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GADDR2</name>
              <description>Contains the lower 32 bits of the 64-bit hash table used in the address recognition process for receive frames with a multicast address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TFWR</name>
          <description>Transmit FIFO Watermark Register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TFWR</name>
              <description>Transmit FIFO Write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TFWR_0</name>
                  <description>64 bytes written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TFWR_1</name>
                  <description>64 bytes written.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TFWR_2</name>
                  <description>128 bytes written.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TFWR_3</name>
                  <description>192 bytes written.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TFWR_31</name>
                  <description>1984 bytes written.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRFWD</name>
              <description>Store And Forward Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRFWD_0</name>
                  <description>Reset. The transmission start threshold is programmed in TFWR[TFWR].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRFWD_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RDSR</name>
          <description>Receive Descriptor Ring Start Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R_DES_START</name>
              <description>Pointer to the beginning of the receive buffer descriptor queue.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDSR</name>
          <description>Transmit Buffer Descriptor Ring Start Register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>X_DES_START</name>
              <description>Pointer to the beginning of the transmit buffer descriptor queue.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MRBR</name>
          <description>Maximum Receive Buffer Size Register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R_BUF_SIZE</name>
              <description>Receive buffer size in bytes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSFL</name>
          <description>Receive FIFO Section Full Threshold</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_SECTION_FULL</name>
              <description>Value Of Receive FIFO Section Full Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSEM</name>
          <description>Receive FIFO Section Empty Threshold</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_SECTION_EMPTY</name>
              <description>Value Of The Receive FIFO Section Empty Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STAT_SECTION_EMPTY</name>
              <description>RX Status FIFO Section Empty Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAEM</name>
          <description>Receive FIFO Almost Empty Threshold</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_ALMOST_EMPTY</name>
              <description>Value Of The Receive FIFO Almost Empty Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAFL</name>
          <description>Receive FIFO Almost Full Threshold</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_ALMOST_FULL</name>
              <description>Value Of The Receive FIFO Almost Full Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSEM</name>
          <description>Transmit FIFO Section Empty Threshold</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_SECTION_EMPTY</name>
              <description>Value Of The Transmit FIFO Section Empty Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAEM</name>
          <description>Transmit FIFO Almost Empty Threshold</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_ALMOST_EMPTY</name>
              <description>Value of Transmit FIFO Almost Empty Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
