cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USBNC1">
      <name>USBNC2</name>
      <description>USB</description>
      <groupName>USBNC</groupName>
      <prependToName>USBNC_</prependToName>
      <baseAddress>0x402E0004</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x81C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>SEMC</name>
      <description>SEMC</description>
      <groupName>SEMC</groupName>
      <baseAddress>0x402F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SEMC</name>
        <value>109</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDIS_0</name>
                  <description>Module enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDIS_1</name>
                  <description>Module disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSMD</name>
              <description>DQS (read strobe) mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DQSMD_0</name>
                  <description>Dummy read strobe loopbacked internally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DQSMD_1</name>
                  <description>Dummy read strobe loopbacked from DQS pad or DLL delay chain. Details information at descriptions of DQSSEL bit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPOL0</name>
              <description>WAIT/RDY# polarity for NOR/PSRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPOL0_0</name>
                  <description>Low active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPOL0_1</name>
                  <description>High active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPOL1</name>
              <description>WAIT/RDY# polarity for NAND</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPOL1_0</name>
                  <description>Low active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPOL1_1</name>
                  <description>High active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSSEL</name>
              <description>Select DQS source when DQSMD and DLLSEL both set.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DQSSEL_0</name>
                  <description>SDRAM/NOR/SRAM read clock source is from DQS pad in synchronous mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DQSSEL_1</name>
                  <description>SDRAM/NOR/SRAM read clock source is from DLL delay chain in synchronous mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLLSEL</name>
              <description>Select DLL delay chain clock input.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLLSEL_0</name>
                  <description>DLL delay chain clock input is from NAND device's DQS pad. For NAND synchronous mode only.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLLSEL_1</name>
                  <description>DLL delay chain clock input is from internal clock. For SDRAM, NOR and SRAM synchronous mode only.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTO</name>
              <description>Command Execution timeout cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTO</name>
              <description>Bus timeout cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BTO_0</name>
                  <description>255*1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_1</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_2</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_3</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_4</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_5</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_6</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_7</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_8</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_9</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_31</name>
                  <description>255*2^31</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCR</name>
          <description>IO Mux Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_A8</name>
              <description>SEMC_A8 output selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_A8_0</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_1</name>
                  <description>NAND CE#</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_2</name>
                  <description>NOR CE#</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_3</name>
                  <description>PSRAM CE#</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_4</name>
                  <description>DBI CSX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_5</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_6</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_7</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX0</name>
              <description>SEMC_CSX0 output selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX0_0</name>
                  <description>NOR/PSRAM Address bit 24 (A24)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_6</name>
                  <description>PSRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX1</name>
              <description>SEMC_CSX1 output selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX1_0</name>
                  <description>NOR/PSRAM Address bit 25 (A25)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_6</name>
                  <description>PSRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX2</name>
              <description>SEMC_CSX2 output selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX2_0</name>
                  <description>NOR/PSRAM Address bit 26 (A26)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_6</name>
                  <description>PSRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX3</name>
              <description>SEMC_CSX3 output selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX3_0</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_6</name>
                  <description>PSRAM CE#</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_RDY</name>
              <description>SEMC_RDY function selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_RDY_0</name>
                  <description>NAND Ready/Wait# input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_4</name>
                  <description>NOR CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_5</name>
                  <description>PSRAM CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_6</name>
                  <description>DBI CSX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_7</name>
                  <description>NOR/PSRAM Address bit 27</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CLKX0</name>
              <description>SEMC_CLKX0 function selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CLKX0_0</name>
                  <description>NOR clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CLKX0_1</name>
                  <description>SRAM clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CLKX1</name>
              <description>SEMC_CLKX1 function selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CLKX1_0</name>
                  <description>NOR clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CLKX1_1</name>
                  <description>SRAM clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
