cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI2</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x40398000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI2</name>
        <value>33</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI3</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x4039C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI3</name>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI4</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x403A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI4</name>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC_ETC</name>
      <description>ADC_ETC</description>
      <groupName>ADC_ETC</groupName>
      <baseAddress>0x403B0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x150</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_ETC_IRQ0</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ1</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ2</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_ERROR_IRQ</name>
        <value>121</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>ADC_ETC Global Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG_ENABLE</name>
              <description>TRIG enable register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT0_TRIG_ENABLE</name>
              <description>TSC0 TRIG enable register. 1'b1: enable external TSC0 trigger. 1'b0: disable external TSC0 trigger.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT0_TRIG_PRIORITY</name>
              <description>External TSC0 trigger priority, 7 is Highest, 0 is lowest .</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT1_TRIG_ENABLE</name>
              <description>TSC1 TRIG enable register. 1'b1: enable external TSC1 trigger. 1'b0: disable external TSC1 trigger.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT1_TRIG_PRIORITY</name>
              <description>External TSC1 trigger priority, 7 is Highest, 0 is lowest .</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_DIVIDER</name>
              <description>Pre-divider for trig delay and interval .</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_MODE_SEL</name>
              <description>1'b0: Trig DMA_REQ with latched signal, REQ will be cleared when ACK and source request cleared</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSC_BYPASS</name>
              <description>1'b1: TSC is bypassed to ADC2. 1'b0: TSC not bypassed. To use ADC2, this bit should be cleared.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTRST</name>
              <description>Software reset, high active. When write 1 ,all logical will be reset.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE0_1_IRQ</name>
          <description>ETC DONE0 and DONE1 IRQ State Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG0_DONE0</name>
              <description>TRIG0 done0 interrupt detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG1_DONE0</name>
              <description>TRIG1 done0 interrupt detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG2_DONE0</name>
              <description>TRIG2 done0 interrupt detection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG3_DONE0</name>
              <description>TRIG3 done0 interrupt detection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG4_DONE0</name>
              <description>TRIG4 done0 interrupt detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG5_DONE0</name>
              <description>TRIG5 done0 interrupt detection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG6_DONE0</name>
              <description>TRIG6 done0 interrupt detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG7_DONE0</name>
              <description>TRIG7 done0 interrupt detection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG0_DONE1</name>
              <description>TRIG0 done1 interrupt detection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG1_DONE1</name>
              <description>TRIG1 done1 interrupt detection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG2_DONE1</name>
              <description>TRIG2 done1 interrupt detection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG3_DONE1</name>
              <description>TRIG3 done1 interrupt detection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG4_DONE1</name>
              <description>TRIG4 done1 interrupt detection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG5_DONE1</name>
              <description>TRIG5 done1 interrupt detection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG6_DONE1</name>
              <description>TRIG6 done1 interrupt detection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG7_DONE1</name>
              <description>TRIG7 done1 interrupt detection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DONE2_ERR_IRQ</name>
          <description>ETC DONE_2 and DONE_ERR IRQ State Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG0_DONE2</name>
              <description>TRIG0 done2 interrupt detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG1_DONE2</name>
              <description>TRIG1 done2 interrupt detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG2_DONE2</name>
              <description>TRIG2 done2 interrupt detection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG3_DONE2</name>
              <description>TRIG3 done2 interrupt detection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG4_DONE2</name>
              <description>TRIG4 done2 interrupt detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG5_DONE2</name>
              <description>TRIG5 done2 interrupt detection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG6_DONE2</name>
              <description>TRIG6 done2 interrupt detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG7_DONE2</name>
              <description>TRIG7 done2 interrupt detection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG0_ERR</name>
              <description>TRIG0 error interrupt detection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG1_ERR</name>
              <description>TRIG1 error interrupt detection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG2_ERR</name>
              <description>TRIG2 error interrupt detection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG3_ERR</name>
              <description>TRIG3 error interrupt detection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG4_ERR</name>
              <description>TRIG4 error interrupt detection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG5_ERR</name>
              <description>TRIG5 error interrupt detection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG6_ERR</name>
              <description>TRIG6 error interrupt detection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG7_ERR</name>
              <description>TRIG7 error interrupt detection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CTRL</name>
          <description>ETC DMA control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG0_ENABLE</name>
              <description>When TRIG0 done enable DMA request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG1_ENABLE</name>
              <description>When TRIG1 done enable DMA request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG2_ENABLE</name>
              <description>When TRIG2 done enable DMA request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG3_ENABLE</name>
              <description>When TRIG3 done enable DMA request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG4_ENABLE</name>
              <description>When TRIG4 done enable DMA request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG5_ENABLE</name>
              <description>When TRIG5 done enable DMA request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG6_ENABLE</name>
              <description>When TRIG6 done enable DMA request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG7_ENABLE</name>
              <description>When TRIG7 done enable DMA request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG0_REQ</name>
              <description>When TRIG0 done DMA request detection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG1_REQ</name>
              <description>When TRIG1 done DMA request detection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG2_REQ</name>
              <description>When TRIG2 done DMA request detection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG3_REQ</name>
              <description>When TRIG3 done DMA request detection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG4_REQ</name>
              <description>When TRIG4 done DMA request detection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG5_REQ</name>
              <description>When TRIG5 done DMA request detection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG6_REQ</name>
              <description>When TRIG6 done DMA request detection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG7_REQ</name>
              <description>When TRIG7 done DMA request detection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG0_CTRL</name>
          <description>ETC_TRIG0 Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRIG</name>
              <description>Software write 1 as the TRIGGER. This register is self-clearing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_MODE</name>
              <description>TRIG mode register. 1'b0: hardware trigger. 1'b1: software trigger.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_CHAIN</name>
              <description>TRIG chain length to the ADC. 0: Trig length is 1; ... 7: Trig length is 8;</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_PRIORITY</name>
              <description>External trigger priority, 7 is highest, 0 is lowest .</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_MODE</name>
              <description>TRIG mode control . 1'b0: Disable sync mode; 1'b1: Enable sync mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG0_COUNTER</name>
          <description>ETC_TRIG0 Counter Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INIT_DELAY</name>
              <description>TRIGGER initial delay counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_INTERVAL</name>
              <description>TRIGGER sampling interval counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
