cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>SM3CVAL5</name>
          <description>Capture Value 5 Register</description>
          <addressOffset>0x174</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CAPTVAL5</name>
              <description>CAPTVAL5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM3CVAL5CYC</name>
          <description>Capture Value 5 Cycle Register</description>
          <addressOffset>0x176</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CVAL5CYC</name>
              <description>CVAL5CYC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTEN</name>
          <description>Output Enable Register</description>
          <addressOffset>0x180</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PWMX_EN</name>
              <description>PWM_X Output Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWMX_EN_0</name>
                  <description>PWM_X output disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWMX_EN_1</name>
                  <description>PWM_X output enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWMB_EN</name>
              <description>PWM_B Output Enables</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWMB_EN_0</name>
                  <description>PWM_B output disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWMB_EN_1</name>
                  <description>PWM_B output enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWMA_EN</name>
              <description>PWM_A Output Enables</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWMA_EN_0</name>
                  <description>PWM_A output disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWMA_EN_1</name>
                  <description>PWM_A output enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK</name>
          <description>Mask Register</description>
          <addressOffset>0x182</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MASKX</name>
              <description>PWM_X Masks</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKX_0</name>
                  <description>PWM_X output normal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKX_1</name>
                  <description>PWM_X output masked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKB</name>
              <description>PWM_B Masks</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKB_0</name>
                  <description>PWM_B output normal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKB_1</name>
                  <description>PWM_B output masked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKA</name>
              <description>PWM_A Masks</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKA_0</name>
                  <description>PWM_A output normal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKA_1</name>
                  <description>PWM_A output masked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPDATE_MASK</name>
              <description>Update Mask Bits Immediately</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UPDATE_MASK_0</name>
                  <description>Normal operation. MASK* bits within the corresponding submodule are not updated until a FORCE_OUT event occurs within the submodule.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE_MASK_1</name>
                  <description>Immediate operation. MASK* bits within the corresponding submodule are updated on the following clock edge after setting this bit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCOUT</name>
          <description>Software Controlled Output Register</description>
          <addressOffset>0x184</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SM0OUT45</name>
              <description>Submodule 0 Software Controlled Output 45</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0OUT45_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 0 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0OUT45_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 0 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM0OUT23</name>
              <description>Submodule 0 Software Controlled Output 23</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0OUT23_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 0 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0OUT23_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 0 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1OUT45</name>
              <description>Submodule 1 Software Controlled Output 45</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1OUT45_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 1 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1OUT45_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 1 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1OUT23</name>
              <description>Submodule 1 Software Controlled Output 23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1OUT23_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 1 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1OUT23_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 1 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2OUT45</name>
              <description>Submodule 2 Software Controlled Output 45</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2OUT45_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 2 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2OUT45_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 2 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2OUT23</name>
              <description>Submodule 2 Software Controlled Output 23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2OUT23_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 2 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2OUT23_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 2 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3OUT45</name>
              <description>Submodule 3 Software Controlled Output 45</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM3OUT45_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 3 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3OUT45_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 3 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3OUT23</name>
              <description>Submodule 3 Software Controlled Output 23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM3OUT23_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 3 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3OUT23_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 3 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
