cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>DTSRCSEL</name>
          <description>PWM Source Select Register</description>
          <addressOffset>0x186</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SM0SEL45</name>
              <description>Submodule 0 PWM45 Control Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0SEL45_0</name>
                  <description>Generated SM0PWM45 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0SEL45_1</name>
                  <description>Inverted generated SM0PWM45 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0SEL45_2</name>
                  <description>SWCOUT[SM0OUT45] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0SEL45_3</name>
                  <description>PWM0_EXTB signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM0SEL23</name>
              <description>Submodule 0 PWM23 Control Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0SEL23_0</name>
                  <description>Generated SM0PWM23 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0SEL23_1</name>
                  <description>Inverted generated SM0PWM23 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0SEL23_2</name>
                  <description>SWCOUT[SM0OUT23] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0SEL23_3</name>
                  <description>PWM0_EXTA signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1SEL45</name>
              <description>Submodule 1 PWM45 Control Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1SEL45_0</name>
                  <description>Generated SM1PWM45 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1SEL45_1</name>
                  <description>Inverted generated SM1PWM45 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1SEL45_2</name>
                  <description>SWCOUT[SM1OUT45] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1SEL45_3</name>
                  <description>PWM1_EXTB signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1SEL23</name>
              <description>Submodule 1 PWM23 Control Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1SEL23_0</name>
                  <description>Generated SM1PWM23 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1SEL23_1</name>
                  <description>Inverted generated SM1PWM23 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1SEL23_2</name>
                  <description>SWCOUT[SM1OUT23] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1SEL23_3</name>
                  <description>PWM1_EXTA signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2SEL45</name>
              <description>Submodule 2 PWM45 Control Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2SEL45_0</name>
                  <description>Generated SM2PWM45 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2SEL45_1</name>
                  <description>Inverted generated SM2PWM45 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2SEL45_2</name>
                  <description>SWCOUT[SM2OUT45] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2SEL45_3</name>
                  <description>PWM2_EXTB signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2SEL23</name>
              <description>Submodule 2 PWM23 Control Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2SEL23_0</name>
                  <description>Generated SM2PWM23 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2SEL23_1</name>
                  <description>Inverted generated SM2PWM23 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2SEL23_2</name>
                  <description>SWCOUT[SM2OUT23] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2SEL23_3</name>
                  <description>PWM2_EXTA signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3SEL45</name>
              <description>Submodule 3 PWM45 Control Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM3SEL45_0</name>
                  <description>Generated SM3PWM45 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3SEL45_1</name>
                  <description>Inverted generated SM3PWM45 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3SEL45_2</name>
                  <description>SWCOUT[SM3OUT45] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3SEL45_3</name>
                  <description>PWM3_EXTB signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3SEL23</name>
              <description>Submodule 3 PWM23 Control Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM3SEL23_0</name>
                  <description>Generated SM3PWM23 signal is used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3SEL23_1</name>
                  <description>Inverted generated SM3PWM23 signal is used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3SEL23_2</name>
                  <description>SWCOUT[SM3OUT23] is used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3SEL23_3</name>
                  <description>PWM3_EXTA signal is used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRL</name>
          <description>Master Control Register</description>
          <addressOffset>0x188</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LDOK</name>
              <description>Load Okay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOK_0</name>
                  <description>Do not load new values.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOK_1</name>
                  <description>Load prescaler, modulus, and PWM values of the corresponding submodule.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLDOK</name>
              <description>Clear Load Okay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN</name>
              <description>Run</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN_0</name>
                  <description>PWM generator is disabled in the corresponding submodule.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_1</name>
                  <description>PWM generator is enabled in the corresponding submodule.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPOL</name>
              <description>Current Polarity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPOL_0</name>
                  <description>PWM23 is used to generate complementary PWM pair in the corresponding submodule.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPOL_1</name>
                  <description>PWM45 is used to generate complementary PWM pair in the corresponding submodule.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRL2</name>
          <description>Master Control 2 Register</description>
          <addressOffset>0x18A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MONPLL</name>
              <description>Monitor PLL State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MONPLL_0</name>
                  <description>Not locked. Do not monitor PLL operation. Resetting of the fractional delay block in case of PLL losing lock will be controlled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONPLL_1</name>
                  <description>Not locked. Monitor PLL operation to automatically disable the fractional delay block when the PLL encounters problems.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONPLL_2</name>
                  <description>Locked. Do not monitor PLL operation. Resetting of the fractional delay block in case of PLL losing lock will be controlled by software. These bits are write protected until the next reset.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONPLL_3</name>
                  <description>Locked. Monitor PLL operation to automatically disable the fractional delay block when the PLL encounters problems. These bits are write protected until the next reset.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRL0</name>
          <description>Fault Control Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FIE</name>
              <description>Fault Interrupt Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIE_0</name>
                  <description>FAULTx CPU interrupt requests disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIE_1</name>
                  <description>FAULTx CPU interrupt requests enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSAFE</name>
              <description>Fault Safety Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSAFE_0</name>
                  <description>Normal mode. PWM outputs disabled by this fault are not enabled until FSTS[FFLAGx] is clear at the start of a half cycle or full cycle depending on the state of FSTS[FFULL] without regard to the state of FSTS[FFPINx]. The PWM outputs disabled by this fault input will not be re-enabled until the actual FAULTx input signal de-asserts since the fault input will combinationally disable the PWM outputs (as programmed in DISMAPn).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSAFE_1</name>
                  <description>Safe mode. PWM outputs disabled by this fault are not enabled until FSTS[FFLAGx] is clear and FSTS[FFPINx] is clear at the start of a half cycle or full cycle depending on the state of FSTS[FFULL].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAUTO</name>
              <description>Automatic Fault Clearing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAUTO_0</name>
                  <description>Manual fault clearing. PWM outputs disabled by this fault are not enabled until FSTS[FFLAGx] is clear at the start of a half cycle or full cycle depending the state of FSTS[FFULL]. This is further controlled by FCTRL[FSAFE].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAUTO_1</name>
                  <description>Automatic fault clearing. PWM outputs disabled by this fault are enabled when FSTS[FFPINx] is clear at the start of a half cycle or full cycle depending on the state of FSTS[FFULL] without regard to the state of FSTS[FFLAGx].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLVL</name>
              <description>Fault Level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLVL_0</name>
                  <description>A logic 0 on the fault input indicates a fault condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLVL_1</name>
                  <description>A logic 1 on the fault input indicates a fault condition.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSTS0</name>
          <description>Fault Status Register</description>
          <addressOffset>0x18E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FFLAG</name>
              <description>Fault Flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFLAG_0</name>
                  <description>No fault on the FAULTx pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFLAG_1</name>
                  <description>Fault on the FAULTx pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFULL</name>
              <description>Full Cycle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFULL_0</name>
                  <description>PWM outputs are not re-enabled at the start of a full cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFULL_1</name>
                  <description>PWM outputs are re-enabled at the start of a full cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFPIN</name>
              <description>Filtered Fault Pins</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FHALF</name>
              <description>Half Cycle Fault Recovery</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FHALF_0</name>
                  <description>PWM outputs are not re-enabled at the start of a half cycle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FHALF_1</name>
                  <description>PWM outputs are re-enabled at the start of a half cycle (as defined by VAL0).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
