cmsis-svd/cmsis-svd-data/data/NXP/MIMXRT1064.svd
        <register>
          <name>CCSIDR</name>
          <description>Cache Size ID Register</description>
          <addressOffset>0xD80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINESIZE</name>
              <description>(Log2(Number of words in cache line)) - 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LINESIZE_0</name>
                  <description>The line length of 4 words.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINESIZE_1</name>
                  <description>The line length of 8 words.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINESIZE_2</name>
                  <description>The line length of 16 words.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINESIZE_3</name>
                  <description>The line length of 32 words.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINESIZE_4</name>
                  <description>The line length of 64 words.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINESIZE_5</name>
                  <description>The line length of 128 words.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINESIZE_6</name>
                  <description>The line length of 256 words.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINESIZE_7</name>
                  <description>The line length of 512 words.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASSOCIATIVITY</name>
              <description>(Associativity of cache) - 1, therefore a value of 0 indicates an associativity of 1. The associativity does not have to be a power of 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMSETS</name>
              <description>(Number of sets in cache) - 1, therefore a value of 0 indicates 1 set in the cache. The number of sets does not have to be a power of 2.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WA</name>
              <description>Indicates whether the cache level supports write-allocation</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WA_0</name>
                  <description>Feature not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WA_1</name>
                  <description>Feature supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RA</name>
              <description>Indicates whether the cache level supports read-allocation</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RA_0</name>
                  <description>Feature not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RA_1</name>
                  <description>Feature supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB</name>
              <description>Indicates whether the cache level supports write-back</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WB_0</name>
                  <description>Feature not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WB_1</name>
                  <description>Feature supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WT</name>
              <description>Indicates whether the cache level supports write-through</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WT_0</name>
                  <description>Feature not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WT_1</name>
                  <description>Feature supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSSELR</name>
          <description>Cache Size Selection Register</description>
          <addressOffset>0xD84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IND</name>
              <description>Instruction not data bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IND_0</name>
                  <description>Data or unified cache.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IND_1</name>
                  <description>Instruction cache.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEVEL</name>
              <description>Cache level of required cache</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL_0</name>
                  <description>Level 1 cache.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_1</name>
                  <description>Level 2 cache.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_2</name>
                  <description>Level 3 cache.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_3</name>
                  <description>Level 4 cache.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_4</name>
                  <description>Level 5 cache.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_5</name>
                  <description>Level 6 cache.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_6</name>
                  <description>Level 7 cache.</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPACR</name>
          <description>Coprocessor Access Control Register</description>
          <addressOffset>0xD88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CP0</name>
              <description>Access privileges for coprocessor 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP0_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP0_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP0_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP1</name>
              <description>Access privileges for coprocessor 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP1_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP1_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP1_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP2</name>
              <description>Access privileges for coprocessor 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP2_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP2_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP2_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP3</name>
              <description>Access privileges for coprocessor 3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP3_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP3_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP3_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP4</name>
              <description>Access privileges for coprocessor 4.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP4_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP4_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP4_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP5</name>
              <description>Access privileges for coprocessor 5.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP5_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP5_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP5_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP6</name>
              <description>Access privileges for coprocessor 6.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP6_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP6_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP6_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP7</name>
              <description>Access privileges for coprocessor 7.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP7_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP7_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP7_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP10</name>
              <description>Access privileges for coprocessor 10.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP10_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP10_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP10_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP11</name>
              <description>Access privileges for coprocessor 11.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP11_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP11_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP UsageFault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP11_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STIR</name>
          <description>Instruction cache invalidate all to Point of Unification (PoU)</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTID</name>
              <description>Indicates the interrupt to be triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICIALLU</name>
          <description>Instruction cache invalidate all to Point of Unification (PoU)</description>
          <addressOffset>0xF50</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICIALLU</name>
              <description>I-cache invalidate all to PoU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICIMVAU</name>
          <description>Instruction cache invalidate by address to PoU</description>
          <addressOffset>0xF58</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICIMVAU</name>
              <description>I-cache invalidate by MVA to PoU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCIMVAC</name>
          <description>Data cache invalidate by address to Point of Coherency (PoC)</description>
          <addressOffset>0xF5C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCIMVAC</name>
              <description>D-cache invalidate by MVA to PoC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCISW</name>
          <description>Data cache invalidate by set/way</description>
          <addressOffset>0xF60</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCISW</name>
              <description>D-cache invalidate by set-way</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMVAU</name>
          <description>Data cache by address to PoU</description>
          <addressOffset>0xF64</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCCMVAU</name>
              <description>D-cache clean by MVA to PoU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
